Documents/СписаниеИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеИмущества</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиИмущества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комисия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Имущество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеИмущества/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Для Каждого ТекСтрока Из Состав Цикл
        
        // Подготовка параметров для вызова функции из Canvas
        ПараметрыПроверки = Новый Структура;
        ПараметрыПроверки.Вставить("Имущество",        ТекСтрока.Имущество);
        ПараметрыПроверки.Вставить("Количество",       ТекСтрока.Количество);
        ПараметрыПроверки.Вставить("Кабинет",          Кабинет); // Для Списания
        ПараметрыПроверки.Вставить("ПроверятьОстаток", Истина);
        
        // ВНИМАНИЕ: Используем новое имя функции ПроверитьВозможностьДвижения
        Результат = ИнвентаризацияСервер.ПроверитьВозможностьДвижения(ПараметрыПроверки);
        
        Если Не Результат.Успех Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = Результат.Сообщение;
            Сообщение.Сообщить();
            
            Отказ = Истина; // Прерываем проведение
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры
